# Задача 2: Найдите сумму цифр трехзначного числа.*
# *Пример: *
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
x = input('Введите трёхзначное число: ')
print('Сумма цифр числа ', x, ' = ', int(x[0])+int(x[1])+int(x[2]))
